/**
 * Базовые конструкции
 * 
 * Условия, циклы, switch
 */

/**
 * Условия это базовая и часто встречающаясь в программировании конструкция
 * 
 * В условной конструкции основным является условное выражение,
 * которое возвращает либо правду либо ложь. То есть логическое значение.
 * В зависимости от этого выполняется либо первый блок кода либо второй.
 * 
 */

if (false) {
    console.log("Это правда");
} else {
    console.log("Это ложь");
}

let basketPrice = 0;

if (basketPrice > 0) {
    console.log("Корзина наполнена, можете сделать заказ");
    console.log("");
} else {
    console.log("Корзина пуста!");
}

